CSI API ETABS v1
cPointObj Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cPointObj
Public Interface cPointObj
Dim instance As cPointObj
public interface class cPointObj
type cPointObj =  interface end
The cPointObj type exposes the following members.
Methods
Name | Description
AddCartesian
 Adds a point object to a model. The added point object will be tagged as a Special Point except if it was merged with another point object. Special points are allowed to exist in the model with no objects connected to them.
ChangeName
Count
CountLoadDispl
CountLoadForce
CountPanelZone
CountRestraint
CountSpring
DeleteLoadDispl
 Deletes all ground displacement load assignments, for the specified load pattern, from the specified point object(s).
DeleteLoadForce
 Deletes all point force load assignments, for the specified load pattern, from the specified point object(s).
DeleteMass
DeletePanelZone
DeleteRestraint
 Deletes all restraint assignments from the specified point object(s).
DeleteSpecialPoint
 Deletes special point objects that have no other objects connected to them.
DeleteSpring
 Deletes all point spring assignments from the specified point object(s).
GetAllPoints
 Retrieves selected data for all point objects in the model
GetCommonTo
GetConnectivity
 Retrieves a list of objects connected to a specified point object
GetCoordCartesian
 Retrieves the x, y and z coordinates of the specified point object in the Present Units.
GetCoordCylindrical
GetCoordSpherical
GetDiaphragm
 Retrieves the diaphragm for a specified point object
GetElm
GetGroupAssign
 Retrieves the groups to which a point object is assigned.
GetGUID
 Retrieves the GUID for specified point object.
GetLabelFromName
 Retrieves the label and story for a unique point object name
GetLabelNameList
 Retrieves the names and labels of all defined point objects.
GetLoadDispl
 Retrieves the ground displacement load assignments to point objects.
GetLoadForce
 Retrieves the joint force load assignments to point objects.
GetLocalAxes
 Retrieves the local axis angles for a point object.
GetMass
GetNameFromLabel
 Retrieves the unique name of a point object, given the label and story level
GetNameList
 Retrieves the names of all defined point objects.
GetNameListOnStory
 Retrieves the names of the defined point objects on a given story.
GetPanelZone
GetRestraint
 Retrieves the restraint assignments for a point object. The restraint assignments are always returned in the point local coordinate system.
GetSelected
GetSpecialPoint
GetSpring
 Retrieves uncoupled spring stiffness assignments for a point object, that is, it retrieves the diagonal terms in the 6x6 spring matrix for the point object.
GetSpringAssignment
 Retrieves the named point spring property assignment for a point object
GetSpringCoupled
GetTransformationMatrix
IsSpringCoupled
SetDiaphragm
 Assigns a diaphragm to a point object
SetGroupAssign
 Adds or removes point objects from a specified group.
SetGUID
 Sets the GUID for specified point object. If the GUID is passed in as a blank string, the program automatically creates a GUID for the object.
SetLoadDispl
 Makes ground displacement load assignments to point objects.
SetLoadForce
 Makes point force load assignments to point objects.
SetMass
SetMassByVolume
SetMassByWeight
SetPanelZone
SetRestraint
 Assigns the restraint assignments for a point object. The restraint assignments are always set in the point local coordinate system.
SetSelected
 Sets the selected status for a point object.
SetSpecialPoint
 Sets the special point status for a point object.
SetSpring
 Assigns coupled springs to a point object.
SetSpringAssignment
 Assigns an existing named point spring property to point objects
SetSpringCoupled
Top
See Also
Reference
ETABSv1 Namespace